
import matplotlib.pyplot as plt
import numpy as np
a=[]
c=[151605001,151605002,151605004,151605005,
151605006,151605007,151605008,151605009,
151605010,151605011,151605012,151605013,
151605014,151605015,151605016,151605017,
151605018,151605020,151605021,151605022,
151605023,151605024,151605025,151605026,
151605027,151605028,151605029,151605030,
151605031,151605032,151605034,151605035,
151605036,151605037,151605038,151605039,
151605040,151605041,151605042,151605043,
151605044,151605045]
b=["蔡诗明","陈家润","陈琦禹","陈晓楠","陈樱莺",
"邓可柔","丁杨","杜晓杨","范德润","范集铭","冯筱媛",
"古慧绮","郭昱源","郭远醇","贺咏仪","洪楚雯","江文基"
,"赖三穗","李采薇","李钰莹","练杏玲","梁舒城","廖宇恒",
"卢晓婷","罗恒晖","罗文清","欧家彤","彭嘉怡","彭康乐",
"苏俊伟","吴梓扬","谢颖","徐坤城","许子牧","杨朝雯","叶孙恒",
"詹广裕","张鸿林","张琳","张渝","朱梓杰","侯世中"]
for i in range(43):
    a.append(i)

for i in range(43):
    print("三5班")
    print(a[i+1],c[i],b[i])
    
    params = dict(
    fname = R"C:\Users\HUAWEI\Desktop\python\三51.csv",
    delimiter = ',',
    usecols = (0,a[i+1]),

    unpack = True
    )
    date,score= np.loadtxt(**params)
    print(date)
    print(score)

    x=date
    y=score
    plt.plot(x,y)
    plt.show()
